{"readme":"# ![WackyRotations](Assets/spinny_bramble.webp)\n\n# Wacky Rotations\n> Oh, Hatchling! Be careful out there, okay? The other travellers are reporting that planets have started acting weird, apparently they just sort of... spin in random directions? Yeah, I don't know\n> what that's about, just don't let the radio tower hit you on the way out or anything like that. Anyway, good luck!<br />\n<br />\nAn absolutely stupid mod inspired by the wonderful tomfoolery I experienced while playing PacificEngines [Randomizer Mod](https://outerwildsmods.com/mods/randomizer/). Gives the player some control over\nthe rotational behaviour of the Outer Wilds planets, moon and comet. This mod is not meant to be used in any serious manner, and it's incredibly easy to accidentally kill yourself with it.\n\n# What Exactly Does This Mod Do?\nSpecifically, this mod allows the planets to spin in any direction with a speed specified by the player. Additionally, the planets can randomly change spin directions, with the time between changes also\nbeing controlled by the player.\n\n# Bodies\nMost of the planetary bodies can be manipulated with this mod. Specifically, the following bodies can be controlled:\n* Ash Twin<br />\n* Ember Twin<br />\n* Timber Hearth<br />\n* The Attelrock<br />\n* Brittle Hollow<br />\n* Hollow's Lantern<br />\n* Giant's Deep<br />\n* Dark Bramble<br />\n* The Interloper\n\n# Settings\nEach body that can be manipulated has the following settings:<br />\n* **Rotation Speed** - The speed with which the body will rotate, in rotations/sec.<br />\n* **TTC** - The time (in seconds) between rotation changes.<br />\n\n# Bugs\nI'm not sure what (if anything) it actually affects, but while playing the mod you will likely have many console messages pop up, stating that 'Rotation quaternions must be unit length'. I do not know\nwhat this means, but since this is already a goofy mod, I'm not super concerned. That said, do let me know if you have any ideas on how to fix it, I go by coderCleric on the modding discord.","externalImages":{"Assets/spinny_bramble.webp":{"url":"/images/optimized/-282102755-w800h50850finside.webp","openGraphUrl":"/images/optimized/-282102755-w800h50850finside.webp","width":800,"height":450,"format":"webp"}}}