{"readme":"##  This is a fork from [RuntimeUnityEditor](https://github.com/ManlyMarco/RuntimeUnityEditor) which makes it compatible with Unity 4.1.\n\nAnd to do so **some features have been cut off** for now, in the future they may be reimplemented, but the core Scene Browser, the Console and Component viewer are still working\n\n# Runtime Unity Editor / Debugging Tools\nIn-game inspector, editor and interactive console for applications made with Unity3D game engine. It's designed for debugging and modding Unity games, but can also be used as a universal trainer.\n\n### Features\n- Works on most Unity games supported by [BepInEx](https://github.com/BepInEx/BepInEx)\n- GameObject and component browser\n- Object inspector that allows modifying values of objects in real time\n- REPL C# console\n- All parts are integrated together (e.g. REPL console can access inspected object, inspector can focus objects on GameObject list, etc.)\n\n![preview](https://user-images.githubusercontent.com/39247311/64476158-ce1a4c00-d18b-11e9-97d6-084452cdbf0a.PNG)\n\n### How to use\n1. Install BepInEx v4.x or v5.x if you don't have it already. You can download it [here](https://github.com/BepInEx/BepInEx\n).\n2. Download the latest build from the [Releases](https://github.com/ManlyMarco/RuntimeUnityEditor/releases) page. Make sure to get the correct version for your BepInEx.\n3. Extract the BepInEx folder from the archive directly into your game directory (you should already have a BepInEx folder there from previous step). Replace files if asked.\n4. To turn on press the F12 key when in-game. A window should appear on top of the game. If it doesn't appear, check logs for errors.\n\nNote: If the plugin fails to load under BepInEx 4 with a type load exception, move RuntimeUnityEditor.Core.dll to BepInEx/core folder.\n\n### How to build\n1. Get Visual Studio 2019 (recommended) or the latest version of Visual Studio 2017.\n2. Clone the repository recursively (`git clone --recursive https://github.com/ManlyMarco/RuntimeUnityEditor`). \n3. Open the solution in Visual Studio and hit Build All.\n\nNotes:\n- If you already have the repository cloned or want to update the mcs submodule you need to run `git submodule update --init --recursive` on your local repository.\n- You have to reference UnityEngine.dll from Unity 5.x. The new UnityEngine.dll forwards all of the split types into their new respective dll files, therefore doing this allows runtime editor to run on any Unity version.\n\n---\n\nYou can support development of my plugins through my Patreon page: https://www.patreon.com/ManlyMarco\n","externalImages":{"https://user-images.githubusercontent.com/39247311/64476158-ce1a4c00-d18b-11e9-97d6-084452cdbf0a.PNG":{"url":"/images/optimized/-244932133-w800h892finside.webp","openGraphUrl":"/images/optimized/-244932133-w800h892finside.webp","width":800,"height":582,"format":"png"}}}