{"readme":"# Echoes of the Caribbean\n\n![logo](https://user-images.githubusercontent.com/94204968/143984111-ad096883-b83e-4e79-a3cd-27906f353438.jpg)\n\n## SPOILERS: Mid-game spoilers for Outer Wilds: Echoes of the Eye below.  \n\n## SEIZURE WARNING: End of Line mode includes strobing lights.\n\n#### v  \n\n#### v  \n\n#### v  \n\n#### v  \n\n#### v  \n\n#### v  \n\n### Pirates of the Eye\n\nThis mod replaces the dour music coming from the house in the first dark area with the main theme from the Pirates of the Caribbean ride at Disney resorts.  \nSmell the bromine in the water, feel the air conditioned breeze on your face, and watch your step as you walk onto the ride vehicle!\n\n### Daft Punk End of Line mode\n\nOr, you can choose End of Line mode for a light show and the club music from Tron: Legacy - Daft Punk's \"Derezzed\". The ambient music changes too.\n\n| Key Combo | Description |\n|:---------:|:-----------:|\n`,` + `;` | Engage End of Line mode. This setting is also in the config file/menu.\n`,` + `'` | Disengage End of Line and play the standard audio.\n\n### After the ride\n\nPast the house, or wherever you like, you can also play the music as background ambience.\n\n#### Ambient music control\n| Key Combo | Description |\n|:---------:|:-----------:|\n`,` + `/` | Increase volume, starting play at min volume if it was off.\n`,` + `.` | Decrease volume, stopping it if volume is now zero.\n\nThe music can be replaced with any sound loop of your choice by replacing the .mp3 file with one of the same name, or by editing a new name into config.json. Audio formats besides mp3 may work.\n\n#### Disclaimers\n\nThe default music assets (raw and mixed version of the clip) in this project are copyright of Disney and are excluded from the MIT license. Videos containing these clips may be subject to auto-takedown. I don't intend to profit from this mod, please let us have our fun.\n\n#### Todo\n* Restaurant at starting area with fake fireflies\n","externalImages":{"https://user-images.githubusercontent.com/94204968/143984111-ad096883-b83e-4e79-a3cd-27906f353438.jpg":{"url":"/images/optimized/718635076-w400h142finside.webp","openGraphUrl":"/images/optimized/718635076-w400h142finside.webp","width":400,"height":142,"format":"jpeg"}}}