{"readme":"# Everyone playing Outer Wilds in the same universe at different times!\n## Harnessing the power of the Ash Twin Project I have managed to pluck hearthians from all different timelines into a singular, ~~buggier~~ universe!\n![OuterWildsOnline](https://user-images.githubusercontent.com/59376295/142878134-226b02ed-f761-4bf7-85c7-0c6b159f62a7.png)\n\nEssentially everyone is playing through their own loop, and broadcasting their positions and chat to each other to simulate a multiplayer experience.\n\nBefore setting player colour in the config, your colours will be determined using a hash of your profile's name.\n\nOnce the mod is downloaded, press the CONNECT TO SERVER button and then RESUME EXPEDITION.\n\nCurrently Synced:<br />\n- Player body.<br />\n  - Player flashlight.<br />\n  - Player roasting stick.<br />\n  - Player thrusters.<br />\n- Player Ship.<br />\n  - Ship Thrusters.<br />\n- Probe (both the ship's and the player's).<br />\n\nConfig options:<br />\n- Server address - Keep as gameserver.hopto.org unless joining unofficial servers.<br />\n- Clothes Colour - A 255,255,255 RGB colour setting changing the tint of your Clothes.\n- Hands Colour - A 255,255,255 RGB colour setting changing the tint of your Hands.\n- Head Colour - A 255,255,255 RGB colour setting changing the tint of your Head.\n- Jetpack Colour - A 255,255,255 RGB colour setting changing the tint of your Jetpack.\n\n### Want to set up your own server?\nhttps://www.smartfoxserver.com/download/sfs2x#p=installer\nDownload the SFS server, then transfer the server files from this repo (SFS folder) to the server files.\n\nAny questions? Feel free to ping me on the Outer Wilds Discord - @Vesper\n\nWant to contribute? Great! Check out the TODO project and have a go at creating something there, if you need any help or guidence, give me a ping in the [Outer Wilds Modding Discord](https://discord.gg/9vE5aHxcF9)!\n\nThanks for reading and I hope you have fun!\n","externalImages":{"https://user-images.githubusercontent.com/59376295/142878134-226b02ed-f761-4bf7-85c7-0c6b159f62a7.png":{"url":"/images/optimized/-956652212-w800h650finside.webp","openGraphUrl":"/images/optimized/-956652212-w800h650finside.webp","width":800,"height":286,"format":"png"}}}